docments/org/zookeeper.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>zookeeper</title>
<!-- 2016-03-23 三 17:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css"
    href="/home/cj/.emacs.d/org/css/htmlize.css"/>

<link rel="stylesheet" type="text/css"
    href="/home/cj/.emacs.d/org/css/bigblow.css"/>

<link rel="stylesheet" type="text/css"
    href="/home/cj/.emacs.d/org/css/hideshow.css"/>










</head>
<body>
<div id="content">
<h1 class="title">zookeeper</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本原理</a>
<ul>
<li><a href="#sec-1-1">1.1. 数据模型</a></li>
<li><a href="#sec-1-2">1.2. 节点概念</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. ZNode</a></li>
<li><a href="#sec-1-2-2">1.2.2. Session</a></li>
<li><a href="#sec-1-2-3">1.2.3. Watcher</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. ZooKeeper特性</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. 读、写（更新）模式</a></li>
<li><a href="#sec-1-3-2">1.3.2. WAL(Write-Ahead-Log)和Snapshot</a></li>
<li><a href="#sec-1-3-3">1.3.3. FIFO(first in first out)</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. 典型应用场景</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本原理</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 数据模型</h3>
<div class="outline-text-3" id="text-1-1">
<p>
节点之间形成一个树形结构，类似 *nix 下的文件系统
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 节点概念</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> ZNode</h4>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li>Regular ZNode: 常规型ZNode，用户需要显式的创建、删除
</li>
<li>Ephemeral ZNode: 临时性ZNode，用户创建它之后，可以显式的删除，也可以在创建它的Session结束后，
由ZooKeeper Server自动删除
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Session</h4>
<div class="outline-text-4" id="text-1-2-2">
<ol class="org-ol">
<li>Client与ZooKeeper之间的通信，需要创建一个Session，这个Session会有一个超时时间。
</li>
<li>实际应用中，如果Client与Server之间的通信足够频繁，Session的维护就不需要其他额外的消息了。否则，
ZooKeeper Client会每 t/3 ms 发一次心跳给Server，如果Client 2t/3 ms 没收到来自Server的回应，就会
切换到一个新的ZooKeeper Server上。这里t是用户配置的Session的超时时间。
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Watcher</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
ZooKeeper支持一种Watch的操作，Client可以在某个ZNode上设置一个Watcher，来Watch该ZNode上的变化。
如果有相应变化，就会出发Watcher，把相应的事件通知给设置Watcher的Client。该Watcher时一次性的，触发
一次就会被取消。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> ZooKeeper特性</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 读、写（更新）模式</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
1） 读：从任何一个ZooKeeper Server读
2） 写：先转发到Leader，然后由Leader通过ZooKeeper中的原子广播协议，将请求广播给
所有的Follower，Leader收到一半以上的写成功的Ack后，就认为该写成功了，就会将该写进行持久化，
并告诉客户端写成功了。
</p>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> WAL(Write-Ahead-Log)和Snapshot</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
1）每一个更新操作，ZooKeeper都会先写WAL，然后再对内存中的数据做更新，然后向Client通知更新结果。
2）定期将内存中的目录树进行Snapshot，落地到磁盘上，这个跟HDFS中的FSImage是比较类似的。
    1.为了数据的持久化
    2.加快重启之后的恢复速度
</p>
</div>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> FIFO(first in first out)</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
所有操作都是遵循FIFO的，这一特性是由下面两个基本特性来保证的：
</p>
<ol class="org-ol">
<li>ZooKeeper Client和Server是基于TCP通信的，TCP保证了C/S之间传输包的顺序。
</li>
<li>S执行客户端请求也是严格按照FIFO顺序的。
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 典型应用场景</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="http://blog.csdn.net/xinguan1267/article/details/38422149">应用场景讲解使用方式、原理</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-03-23 三 17:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
